tube-3d/OpenFOAM-CalculiX/Fluid/0.orig/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    auto0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    interface
    {
	type            fixedValue;
        value           $internalField;
    }

    auto2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}


// ************************************************************************* //
